mohammadfatemieh/BTS/Hardware/IOT_Masterv1/TA_STM32F103RTC8_Masterv2_fwv3/TA_Master_HW2_drivers.c
#include <stdio.h>
#include <math.h>
#include "GPIO_STM32F10x.h"
#include "TA_Master_HW2_drivers.h"
#include "misc.h"
#include "stm32f10x_gpio.h"
//Aux Relay Board
#define AUX_RL1(state) GPIO_PinWrite(GPIOC, 12, state)
#define AUX_RL2(state) GPIO_PinWrite(GPIOC, 11, state)
#define AUX_RL3(state) GPIO_PinWrite(GPIOC, 10, state)
#define AUX_RL4(state) GPIO_PinWrite(GPIOA, 12, state)
#define AUX_RL5(state) GPIO_PinWrite(GPIOA, 8, state)
#define AUX_RL6(state) GPIO_PinWrite(GPIOC, 9, state)
#define AUX_RL7(state) GPIO_PinWrite(GPIOC, 8, state)
#define AUX_RL8(state) GPIO_PinWrite(GPIOC, 7, state)

#define         KEY4X4_COL1          GPIO_PinRead(GPIOB,14)    
#define         KEY4X4_COL2          GPIO_PinRead(GPIOB,13)    
#define         KEY4X4_COL3          GPIO_PinRead(GPIOB,12)    
#define         KEY4X4_COL4          GPIO_PinRead(GPIOB,2)    
#define         KEY4X4_ROW1_UP         GPIO_PinWrite(GPIOB,1,1)//   
#define         KEY4X4_ROW2_UP         GPIO_PinWrite(GPIOB,0,1)//   
#define         KEY4X4_ROW3_UP         GPIO_PinWrite(GPIOC,5,1)//   
#define         KEY4X4_ROW4_UP         GPIO_PinWrite(GPIOC,4,1)//
#define         KEY4X4_ROW1_DOWN         GPIO_PinWrite(GPIOB,1,0)//   
#define         KEY4X4_ROW2_DOWN         GPIO_PinWrite(GPIOB,0,0)//   
#define         KEY4X4_ROW3_DOWN         GPIO_PinWrite(GPIOC,5,0)//   
#define         KEY4X4_ROW4_DOWN         GPIO_PinWrite(GPIOC,4,0)//
const uint8_t  KEY_4X4[4][4]={'D','#','0','*',
								 'C','9','8','7',
								 'B','6','5','4',
								 'A','3','2','1'};	

uint16_t measure_voltage(uint8_t input)
{
	uint16_t temp;
	uint8_t channel;
	
	/* TIM enable counter */
  TIM_Cmd(TIM4, ENABLE);
	if(input==1) channel=6;
	else if(input==2) channel=7;
	else if(input==3) channel=8;
	else if(input==4) channel=9;
	TIM4->CNT=0;//Bat dau dem de tinh time out
	while(GPIO_PinRead(GPIOB,channel)){if(TIM4->CNT>30000) break;};//while for PB6==0;cho xung xuong/ BP6 == PWM1_IN
	while(!GPIO_PinRead(GPIOB,channel)){if(TIM4->CNT>30000) break;};//while for PB6==1;cho xung len
	TIM4->CNT=0;//Bat dau dem
	while(GPIO_PinRead(GPIOB,channel)){if(TIM4->CNT>30000) break;};//while for PB6==0;cho xung xuong
	while(!GPIO_PinRead(GPIOB,channel)){if(TIM4->CNT>30000) break;};//while for PB6==1;cho xung len
	while(GPIO_PinRead(GPIOB,channel)){if(TIM4->CNT>30000) break;};//while for PB6==0;cho xung xuong
	while(!GPIO_PinRead(GPIOB,channel)){if(TIM4->CNT>30000) break;};//while for PB6==1;cho xung len
	while(GPIO_PinRead(GPIOB,channel)){if(TIM4->CNT>30000) break;};//while for PB6==0;cho xung xuong
	while(!GPIO_PinRead(GPIOB,channel)){if(TIM4->CNT>30000) break;};//while for PB6==1;cho xung len
	while(GPIO_PinRead(GPIOB,channel)){if(TIM4->CNT>30000) break;};//while for PB6==0;cho xung xuong
	while(!GPIO_PinRead(GPIOB,channel)){if(TIM4->CNT>30000) break;};//while for PB6==1;cho xung len
	while(GPIO_PinRead(GPIOB,channel)){if(TIM4->CNT>30000) break;};//while for PB6==0;cho xung xuong
	while(!GPIO_PinRead(GPIOB,channel)){if(TIM4->CNT>30000) break;};//while for PB6==1;cho xung len
	temp=TIM4->CNT;
	/* TIM disable counter */
  TIM_Cmd(TIM4, DISABLE);
	if(temp>30000) return 0;
	else return temp;
}
void TIM_Config(void)
{
  GPIO_InitTypeDef GPIO_InitStructure;
	TIM_ICInitTypeDef  TIM_ICInitStructure;
	TIM_TimeBaseInitTypeDef TIM_TimeBaseStructure;
	NVIC_InitTypeDef NVIC_InitStructure;
  
  /* TIM4 clock enable */
  RCC_APB1PeriphClockCmd(RCC_APB1Periph_TIM4, ENABLE);

  /* GPIOB clock enable */
  RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOB, ENABLE);
  
  /* TIM4 channel 1,2,3,4 pin (PB.6,7,8,9) configuration */
  GPIO_InitStructure.GPIO_Pin =  GPIO_Pin_6|GPIO_Pin_7|GPIO_Pin_8|GPIO_Pin_9;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IPU;
  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
  GPIO_Init(GPIOB, &GPIO_InitStructure);
	
/* Enable the TIM4 global Interrupt */
  NVIC_InitStructure.NVIC_IRQChannel = TIM4_IRQn;
  NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 5;
  NVIC_InitStructure.NVIC_IRQChannelSubPriority = 0;
  NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
  NVIC_Init(&NVIC_InitStructure);
  TIM_DeInit(TIM4);
	
	TIM_TimeBaseStructure.TIM_ClockDivision=TIM_CKD_DIV1;
	TIM_TimeBaseStructure.TIM_CounterMode=TIM_CounterMode_Up;
	TIM_TimeBaseStructure.TIM_Period=0xffff;
	TIM_TimeBaseStructure.TIM_Prescaler=100; 
	TIM_TimeBaseInit(TIM4,&TIM_TimeBaseStructure); 
	
//	TIM_ICInitStructure.TIM_Channel = TIM_Channel_1;
//  TIM_ICInitStructure.TIM_ICPolarity = TIM_ICPolarity_Rising;
//  TIM_ICInitStructure.TIM_ICSelection = TIM_ICSelection_DirectTI;
//  TIM_ICInitStructure.TIM_ICPrescaler = TIM_ICPSC_DIV1;
//  TIM_ICInitStructure.TIM_ICFilter = 0x0;
//	TIM_ICInit(TIM4, &TIM_ICInitStructure);
//	TIM_ICInitStructure.TIM_Channel = TIM_Channel_2;
//	TIM_ICInit(TIM4, &TIM_ICInitStructure);
//	TIM_ICInitStructure.TIM_Channel = TIM_Channel_3;
//	TIM_ICInit(TIM4, &TIM_ICInitStructure);
//	TIM_ICInitStructure.TIM_Channel = TIM_Channel_4;
//	TIM_ICInit(TIM4, &TIM_ICInitStructure);
	
/* TIM enable counter */
  //TIM_Cmd(TIM4, ENABLE);
  /* Enable the CC Interrupt Request */
  //TIM_ITConfig(TIM4, TIM_IT_CC1 | TIM_IT_CC2 | TIM_IT_CC3 | TIM_IT_CC4, ENABLE);
	//TIM_ITConfig(TIM4,TIM_IT_Update,ENABLE);
}
void Aux_RL_Control( char CMD)
	{
			if(CMD&0x80) AUX_RL1(0);else AUX_RL1(1);
			if(CMD&0x40) AUX_RL2(0);else AUX_RL2(1);
			if(CMD&0x20) AUX_RL3(0);else AUX_RL3(1);
			if(CMD&0x10) AUX_RL4(0);else AUX_RL4(1);
			if(CMD&0x8) AUX_RL5(0);else AUX_RL5(1);
			if(CMD&0x4) AUX_RL6(0);else AUX_RL6(1);
			if(CMD&0x2) AUX_RL7(0);else AUX_RL7(1);
			if(CMD&0x1) AUX_RL8(0);else AUX_RL8(1);
		   
}
void KeyPad4x4_Init(void)
{
  // Keypad
	GPIO_InitTypeDef GPIO_InitStructure;
	
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOB, ENABLE);
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOC, ENABLE); 
	
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_2|GPIO_Pin_12|GPIO_Pin_13|GPIO_Pin_14;	        
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IPU; 
  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;  
  GPIO_Init(GPIOB, &GPIO_InitStructure);
	

