mohammadfatemieh/BTS/Hardware/IOT_Masterv1/TA_STM32F103RTC8_Masterv2_fwv3/TA_Master_HW2_drivers.c
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_0|GPIO_Pin_1;	        
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_PP; 
  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;  
  GPIO_Init(GPIOB, &GPIO_InitStructure);
	
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_4|GPIO_Pin_5;	        
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_PP; 
  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;  
  GPIO_Init(GPIOC, &GPIO_InitStructure);
	//Relay board
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_7|GPIO_Pin_8|GPIO_Pin_9|GPIO_Pin_10|GPIO_Pin_11|GPIO_Pin_12;	        
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_PP; 
  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;  
  GPIO_Init(GPIOC, &GPIO_InitStructure);
	
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_8|GPIO_Pin_12;	        
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_PP; 
  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;  
  GPIO_Init(GPIOA, &GPIO_InitStructure);
	
	
}

uint8_t  KEY4X4_IsPush(void)
{
    if((KEY4X4_COL1==0)||(KEY4X4_COL2==0)||(KEY4X4_COL3==0)||(KEY4X4_COL4==0))
       return 1;
    else 
       return 0;
}
 /*******************************************************************************
Noi Dung    :   Keo hang thu i xuong muc logic 0, de kiem tra co nut duoc an tai 
                hang thu i hay khong.
Tham Bien   :   i: vi tri hang can kiem tra.
Tra Ve      :   Khong.
********************************************************************************/
void KEY4X4_CheckRow(uint8_t i)
{
KEY4X4_ROW1_UP;
KEY4X4_ROW2_UP;
KEY4X4_ROW3_UP;
KEY4X4_ROW4_UP;
	
if(i==0)
 KEY4X4_ROW1_DOWN;
else if(i==1)
 KEY4X4_ROW2_DOWN;
else if(i==2)
 KEY4X4_ROW3_DOWN;
else
 KEY4X4_ROW4_DOWN;
}
 /*******************************************************************************
Noi Dung    :   Lay gia tri nut nhan duoc an.
Tham Bien   :   Khong.
Tra Ve      :   0:     Neu khong co nut duoc an.
				khac 0: Gia tri cua nut an.
********************************************************************************/
uint8_t  KEY4X4_GetKey(void)
{
	uint8_t  i;
	
 KEY4X4_ROW1_DOWN;
 KEY4X4_ROW2_DOWN;
 KEY4X4_ROW3_DOWN;
 KEY4X4_ROW4_DOWN;

	if(KEY4X4_IsPush())
	{		
			for(i=0;i<4;i++)
			{				
				KEY4X4_CheckRow(i);
				if(!KEY4X4_COL1) return KEY_4X4[i][0];
				if(!KEY4X4_COL2) return KEY_4X4[i][1];
				if(!KEY4X4_COL3) return KEY_4X4[i][2];
				if(!KEY4X4_COL4) return KEY_4X4[i][3];
			}

	}
	return 0;
}

/*******************************************************************************
* Function Name  : 
* Description    : Delay Time
* Input          : - nCount: Delay Time
* Output         : None
* Return         : None
* Return         : None
* Attention		 : None
*******************************************************************************/
static void delay_ms(uint16_t nms)    
{ 
	uint16_t i,j; 
	for( i = 0; i < nms; i++ )
	{ 
		for( j = 0; j < 1141; j++ );
	}
} 

static void delay_us(__IO uint32_t num)
{
	__IO uint32_t index = 0;
	
	/* Default system clock is 72MHz */
	for(index = (6 * num); index != 0; index--);
}

void USER_I2C_Init(void)
{
	I2C_InitTypeDef I2CInit;
// Init I2C
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOB,ENABLE);
	//SCL of I2C2
	GPIO_PinConfigure(GPIOB, 10,
                      GPIO_AF_OPENDRAIN, 
                      GPIO_MODE_OUT50MHZ);
	//SDA of I2C2
	GPIO_PinConfigure(GPIOB, 11,
                      GPIO_AF_OPENDRAIN, 
                      GPIO_MODE_OUT50MHZ);
	//I2C_InitTypeDef I2CInit;
	RCC_APB1PeriphClockCmd(RCC_APB1Periph_I2C2,ENABLE); // Enable I2C2 clock
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_AFIO,ENABLE);
	I2C_DeInit(I2C2); // I2C reset to initial state
	I2CInit.I2C_Mode = I2C_Mode_I2C; // I2C mode is I2C ^_^
	I2CInit.I2C_DutyCycle = I2C_DutyCycle_2; // I2C fast mode duty cycle (WTF is this?)
	I2CInit.I2C_OwnAddress1 = 0; // This device address (7-bit or 10-bit)
	I2CInit.I2C_Ack = I2C_Ack_Enable; // Acknowledgement enable
	I2CInit.I2C_AcknowledgedAddress = I2C_AcknowledgedAddress_7bit; // choose 7-bit address for acknowledgement
	I2CInit.I2C_ClockSpeed = 100000; // 400kHz ?
	I2C_Cmd(I2C2,ENABLE); // Enable I2C
	I2C_Init(I2C2,&I2CInit); // Configure I2C
	while (I2C_GetFlagStatus(I2C2,I2C_FLAG_BUSY)); // Wait until I2C free
}



/* @brief: Giai ma so BCD thanh so thap phan
 * @input: data de giai nen
 * @output: gia tri thap phan
 */
uint8_t BCD2DEC(uint8_t dat)
{
	uint8_t low;
	uint8_t high;
	low = dat & 0x0F;
	high = (dat >> 4)*10;
	return high+low;
}
/* @brief: Giai ma so thap phan thanh so BCD
 * @input: data de giai nen o dang so thap phan
 * @output: gia tri BCD
 */
uint8_t DEC2BCD(uint8_t dat)
{
	uint8_t low;
	uint8_t high;
	low = dat%10;
	high =(dat/10)<<4;
	return high+low;
}

/*DS3231_ReadReg*/
/** 
  * @Author Tuan - 19/10/2014 
  * @brief  DS3231_ReadReg
  * @param  None
  * @retval None
  */
uint8_t DS3231_ReadReg(uint8_t addReg)
{
	uint16_t timeOut = 0xffff;
	uint32_t temp=0;
	uint8_t tempValue;
	/* Gui Start condition */
	I2C_GenerateSTART(I2C_DS3231, ENABLE);
	/* cho time out */
	while(I2C_GetFlagStatus(I2C_DS3231, I2C_FLAG_SB) == RESET)
	{
		if(timeOut-- == 0)
			return 0;
	}
	/* Gui address slave de ghi */
	I2C_SendData(I2C_DS3231, DS3231_ADDRESS_WRITE);
	timeOut = 0xffff;
	while(I2C_GetFlagStatus(I2C_DS3231, I2C_FLAG_ADDR) == RESET)
	{
		if(timeOut-- == 0)
			return 0;
	}
		/* clear addr flag */
	temp = I2C_DS3231->SR2;
	temp++;
	I2C_SendData(I2C_DS3231, addReg);
	/* EV8_2: Wait until BTF is set before programming the STOP */
	while ((I2C_DS3231->SR1 & 0x00004) != 0x000004);
	/* Gui Stop condition */
	I2C_GenerateSTOP(I2C_DS3231, ENABLE);
	
	/* Gui Start condition */
		I2C_GenerateSTART(I2C_DS3231, ENABLE);
		/* cho time out */
		while(I2C_GetFlagStatus(I2C_DS3231, I2C_FLAG_SB) == RESET)
		{
		if(timeOut-- == 0)
			return 0;
		}
		/* Gui address slave de doc */
		I2C_SendData(I2C_DS3231, DS3231_ADDRESS_READ);
		timeOut = 0xffff;
		while(I2C_GetFlagStatus(I2C_DS3231, I2C_FLAG_ADDR) == RESET)
		{
			if(timeOut-- == 0)
				return 0;
		}
		/* clear ack */
		I2C_AcknowledgeConfig(I2C_DS3231, DISABLE);
		/* clear addr flag */
		temp = I2C_DS3231->SR2;
		/* stop */
		I2C_GenerateSTOP(I2C_DS3231, ENABLE);
		/* Cho den khi co du lieu den (RXNE = 1) EV7 */
		while (I2C_GetFlagStatus(I2C_DS3231, I2C_FLAG_RXNE) == RESET);
		tempValue = I2C_ReceiveData(I2C_DS3231);
		while ((I2C_DS3231->CR1&0x200) == 0x200);		
		/* Enable ACK cho luot nhan tiep theo */
		I2C_AcknowledgeConfig(I2C_DS3231, DISABLE);
		return tempValue;
}

/*DS3231_WriteReg*/
/** 
  * @Author Tuan - 19/10/2014 
  * @brief  DS3231_WriteReg
  * @param  None
  * @retval None
  */
uint8_t DS3231_WriteReg(uint8_t addReg, uint8_t Data)
{
	uint16_t timeOut = 0xffff;
	uint32_t temp =0;
	temp = timeOut-timeOut;
	/* Gui Start condition */
	I2C_GenerateSTART(I2C_DS3231, ENABLE);
	/* cho time out */
	while(I2C_GetFlagStatus(I2C_DS3231, I2C_FLAG_SB) == RESET)
	{
		if(timeOut-- == 0)
		return 0;
	}
	/* Gui address slave de ghi */
	I2C_SendData(I2C_DS3231, DS3231_ADDRESS_WRITE);
	timeOut = 0xffff;
	while(I2C_GetFlagStatus(I2C_DS3231, I2C_FLAG_ADDR) == RESET)
	{
		if(timeOut-- == 0)
		return 0;
	}
		/* clear addr flag */
	temp = I2C_DS3231->SR2;
	I2C_SendData(I2C_DS3231, addReg);
		/* clear addr flag */
	temp = I2C_DS3231->SR2;
	temp++;
	I2C_SendData(I2C_DS3231, DEC2BCD(Data));
	/* EV8_2: Wait until BTF is set before programming the STOP */
	while ((I2C_DS3231->SR1 & 0x00004) != 0x000004);
	/* Gui Stop condition */
	I2C_GenerateSTOP(I2C_DS3231, ENABLE);
	return 1;
}

/*DS3231_Set_Time*/
/** 
  * @Author Tuan - 19/10/2014 
  * @brief  DS3231_Set_Time
  * @param  Set time for DS3231
  * @retval True if OK, False if something was wrong
  */
uint8_t DS3231_Set_Time(uint8_t sec,uint8_t min,uint8_t hr,uint8_t day,uint8_t date,uint8_t month, uint16_t year)
{
	uint16_t timeOut = 0xffff;
	uint32_t temp;
	
	I2C_GenerateSTART(I2C_DS3231, ENABLE);
	while(I2C_GetFlagStatus(I2C_DS3231, I2C_FLAG_SB) == RESET)
	{
		if(timeOut-- == 0)
		return 0;
	}
	/* Gui address slave de ghi */
	I2C_SendData(I2C_DS3231, DS3231_ADDRESS_WRITE);
	timeOut = 0xffff;
	while(I2C_GetFlagStatus(I2C_DS3231, I2C_FLAG_ADDR) == RESET)
	{
		if(timeOut-- == 0)
		return 0;
	}
		/* clear addr flag */
	temp = I2C_DS3231->SR2;
	I2C_SendData(I2C_DS3231, 0x00);
		/* clear addr flag */
	temp = I2C_DS3231->SR2;
	I2C_SendData(I2C_DS3231, DEC2BCD(sec));
	temp = I2C_DS3231->SR2;
	while ((I2C_DS3231->SR1 & 0x00004) != 0x000004);
	I2C_SendData(I2C_DS3231, DEC2BCD(min));
	temp = I2C_DS3231->SR2;
	while ((I2C_DS3231->SR1 & 0x00004) != 0x000004);
	I2C_SendData(I2C_DS3231, DEC2BCD(hr));
	temp = I2C_DS3231->SR2;
	while ((I2C_DS3231->SR1 & 0x00004) != 0x000004);
	I2C_SendData(I2C_DS3231, DEC2BCD(day));
	temp = I2C_DS3231->SR2;
	while ((I2C_DS3231->SR1 & 0x00004) != 0x000004);
	I2C_SendData(I2C_DS3231, DEC2BCD(date));
	temp = I2C_DS3231->SR2;
	while ((I2C_DS3231->SR1 & 0x00004) != 0x000004);
	I2C_SendData(I2C_DS3231, DEC2BCD(month));
	temp = I2C_DS3231->SR2;
	while ((I2C_DS3231->SR1 & 0x00004) != 0x000004);
	I2C_SendData(I2C_DS3231, DEC2BCD(year));
	temp = I2C_DS3231->SR2;
	temp++;
	/* EV8_2: Wait until BTF is set before programming the STOP */
	while ((I2C_DS3231->SR1 & 0x00004) != 0x000004);
	/* Gui Stop condition */
	I2C_GenerateSTOP(I2C_DS3231, ENABLE);
	return 1;
}


