mohammadfatemieh/BTS/Hardware/IOT_Masterv1/TA_STM32F103RTC8_Masterv2_fwv3/TA_Master_HW2_drivers.c
void DS3231_init(void)
{
	// Check connection to DS3231
	I2C_GenerateSTART(I2C2,ENABLE); // Send START condition
	while (!I2C_CheckEvent(I2C2,I2C_EVENT_MASTER_MODE_SELECT)); // Wait for EV5
	I2C_Send7bitAddress(I2C2,DS3231_addr,I2C_Direction_Transmitter); // Send DS3231 slave address
	while (!I2C_CheckEvent(I2C2,I2C_EVENT_MASTER_TRANSMITTER_MODE_SELECTED)); // Wait for EV6
	I2C_GenerateSTOP(I2C2,ENABLE);
	
	// Wait for 250ms for DS3231 startup
	//Delay(300);

	// DS3231 init
	I2C_GenerateSTART(I2C2,ENABLE);
	while (!I2C_CheckEvent(I2C2,I2C_EVENT_MASTER_MODE_SELECT)); // Wait for EV5
	I2C_Send7bitAddress(I2C2,DS3231_addr,I2C_Direction_Transmitter); // Send DS3231 slave address
	while (!I2C_CheckEvent(I2C2,I2C_EVENT_MASTER_TRANSMITTER_MODE_SELECTED)); // Wait for EV6
	I2C_SendData(I2C2,DS3231_control); // Send DS3231 control register address
	while (!I2C_CheckEvent(I2C2,I2C_EVENT_MASTER_BYTE_TRANSMITTED)); // Wait for EV8
	I2C_SendData(I2C2,0x00); // DS3231 EOSC enabled, INTCN enabled, SQW set to 1Hz
	while (!I2C_CheckEvent(I2C2,I2C_EVENT_MASTER_BYTE_TRANSMITTED)); // Wait for EV8
	I2C_SendData(I2C2,0x00); // DS3231 clear alarm flags
	while (!I2C_CheckEvent(I2C2,I2C_EVENT_MASTER_BYTE_TRANSMITTED)); // Wait for EV8
	I2C_GenerateSTOP(I2C2,ENABLE);

}


void GLCD_CONST_DATA (void)
{
	glcd_write_com(0x80);
	glcd_put_string("Do am:    60.5% ");
	glcd_write_com(0x90);
	glcd_put_string("Nhiet do: 25.5oC");
	glcd_write_com(0x88);
	glcd_put_string("RL: No Data     ");
	glcd_write_com(0x98);
	glcd_put_string("BT: No Data     ");
}
void	GLCD_GPIO_init(void)
{
	GPIO_InitTypeDef GPIO_InitStructure;
	//GLCD IO
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_4|GPIO_Pin_5|GPIO_Pin_6|GPIO_Pin_7;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_PP;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_Init(GPIOA, &GPIO_InitStructure);
	
}


void glcd_delay(uint8_t time)
{
	uint32_t i=0;
	for(i=0;i<120*time;i++);
}
void glcd_sendbyte(uint8_t zdata)
{
	unsigned int i;
	GLCD_RS(1);
	for(i=0; i<8; i++)
	{
		if((zdata << i) & 0x80)
		{
			GLCD_RW(1);
		}
		else 
		{
			GLCD_RW(0);
		}
		GLCD_EN(1);
		GLCD_EN(0);
	}
	delay_us(80);
}
void glcd_write_com(uint8_t cmdcode)
{
	GLCD_RS(1);
	glcd_sendbyte(0xf8);
	glcd_sendbyte(cmdcode & 0xf0);
	glcd_sendbyte((cmdcode << 4) & 0xf0);
	glcd_delay(80);
	//GLCD_RS(0);	
}
void glcd_write_data(uint8_t Dispdata)
{
	GLCD_RS(1);
	glcd_sendbyte(0xfa);
	glcd_sendbyte(Dispdata & 0xf0);
	glcd_sendbyte((Dispdata << 4) & 0xf0);
	delay_us(80);
}

void glcd_write_cmd(uint8_t cmd)
{
		uint8_t i;
		uint8_t temp;
	
	GLCD_RS(1);//CS
	GLCD_RW(1);//SID
	GLCD_EN(0);//SCLK
	GLCD_EN(1);//SCLK
	GLCD_EN(0);//SCLK
	GLCD_EN(1);//SCLK
	GLCD_EN(0);//SCLK
	GLCD_EN(1);//SCLK
	GLCD_EN(0);//SCLK
	GLCD_EN(1);//SCLK
	GLCD_EN(0);//SCLK
	GLCD_EN(1);//SCLK
	GLCD_EN(0);//SCLK
	GLCD_RW(0);//SID
	GLCD_EN(1);//SCLK
	GLCD_EN(0);//SCLK
	GLCD_EN(1);//SCLK
	GLCD_EN(0);//SCLK
	GLCD_EN(1);//SCLK
	GLCD_EN(0);//SCLK
	
		
	temp=cmd&0xf0;
	for(i=0; i<8; i++)
	{
		if((temp << i) & 0x80)
		{
			GLCD_RW(1);
		}
		else 
		{
			GLCD_RW(0);
		}
		GLCD_EN(1);
		GLCD_EN(0);
	}
	temp=(cmd << 4) & 0xf0;
		for(i=0; i<8; i++)
	{
		if((temp << i) & 0x80)
		{
			GLCD_RW(1);
		}
		else 
		{
			GLCD_RW(0);
		}
		GLCD_EN(1);
		GLCD_EN(0);
	}
	delay_us(80);
	GLCD_RS(0);
}
void GLCD_INIT_(void)
{
	GLCD_RS(1);
	delay_us(150);
	glcd_write_cmd(0x30);//Function Set
	delay_us(100);
	glcd_write_cmd(0x0d);//Display Control
	delay_us(100);
}
void glcd_init(void)
{
	GLCD_RS(0);
	delay_us(150);
	GLCD_RS(1);
	delay_us(150);
	glcd_write_com(0xf8);//sync
	glcd_write_com(0x30);
	delay_us(100);
	glcd_write_com(0xc);
	delay_us(50);
	//GLCD_RS(0);
}

void GLCD_Clear(void)
{
	glcd_write_cmd(1);
	delay_ms(2);
	glcd_write_com(0x8f);
}

void glcd_put_string(char *s)
{
	while(*s > 0)
	{ 
		glcd_write_data(*s);
		s++;
		delay_us(5);
	}
}
void glcd_test(void)
{
	glcd_write_cmd(0x03);//Return Home
	delay_us(80);    
	//glcd_write_com(0x80);//Set DDRAM Address--Address of first character of line 1
	glcd_put_string("0123456789ABCDEF");
	glcd_write_cmd(0x90);//Address of first character of line 2
	glcd_put_string("LCD TEST!   *&^%");
	glcd_write_cmd(0x88);//Address of first character of line 3
	glcd_put_string("qwertyuiopasdfgh");
	glcd_write_cmd(0x98);////Address of first character of line 4
	glcd_put_string("hjklzxcvbnm,./';");
}

//////////////////////////////////////////////////////////////////////////
/*****************************************************************************
  *Ten Tep          :     ds18b20.c
  *Ngay             :     19/06/2014
  *Tac Gia          :     MinhHa R&D Team
  *Cong Ty          :     MinhHaGroup
  *Webside          :     mcu.banlinhkien.vn
  *Phien Ban        :     V1.0
  *Tom Tat          :     Dinh nghia cac ham giao tiep DS18B20
  ******************************************************************************
  * Chu Y        :   Phai dinh nghia chan DQ cua cam bien DS18B20 vao file main.h  
                     Chon do phan giai cho DS18B20 trong file ds18b20.h
    #define DS18B20_DDR_DQ  DDRC_1  // Cau hinh huong IN/OUT cho chan DQ
    #define DS18B20_PIN_DQ  PINC_1  // Xuat du lieu ra cho chan DQ
    #define DS18B20_PORT_DQ PORTC_1 // Doc du lieu vao chan DQ   
    
  * Vi Du        : 
    float32_t temp=0;   // Khai bao bien luu gia tri nhiet do
    DS18B20_Config(15,40,DS18B20_9BIT_RES); // Cau hinh cho DS18B20
    LCD_Init(); // Khoi tao LCD16x2
    
    temp=DS18B20_ReadTemp();    // Doc nhiet do tu DS18B20
    sprintf(str,"temp: %2.2f\xdfC  ",temp); // Hien thi len LCD16x2
    LCD_Gotoxy(0,1);
    LCD_Puts(str);                            
  ******************************************************************************
**/


void GPIO_SetState(GPIO_TypeDef* GPIOx,uint16_t GPIO_Pin,GPIOMode_TypeDef GPIO_Mode)
{
	GPIO_InitTypeDef GPIO_InitStructure;
	GPIO_PortClock   (GPIOx, true);
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin;	         		
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_Init(GPIOx, &GPIO_InitStructure);
}

/*-----------------------------------------------------------------------------
Noi Dung    :   Doc 1 byte du lieu tu DS18B20 ra ngoai. 
Tham Bien   :   Khong. 
Tra Ve      :   Byte du lieu can doc.
  -----------------------------------------------------------------------------*/ 
  
	
uint8_t DS18B20_ReadByte(void)
{   
    uint8_t i=0;
    uint8_t data=0;      
      
    for(i=8;i>0;i--)
    {    
        GPIO_SetState(GPIOC,GPIO_Pin_3,GPIO_Mode_Out_PP);   // Cau hinh chan DQ la OUPUT       
        DS18B20_PORT_DQ_L;  // Keo chan DQ xuong muc '0'
        data>>=1;
        DS18B20_PORT_DQ_H;  // Keo chan DQ len muc '1'      
        GPIO_SetState(GPIOC,GPIO_Pin_3,GPIO_Mode_IPU);   // Cau hinh chan DQ la INPUT
        if(GPIO_PinRead(GPIOC,3))data|=0x80;   // Nhan du lieu tra ve tu DS18B20
        delay_us(120);                                                 
    }
    return(data);    
}	

/*-----------------------------------------------------------------------------
Noi Dung    :   Viet 1 byte du lieu vao DS18B20. 
Tham Bien   :   data: Byte du lieu can viet vao. 
Tra Ve      :   Khong.
  -----------------------------------------------------------------------------*/
  		
void DS18B20_WriteByte(uint8_t data)
{
    uint8_t i=0;
    GPIO_SetState(GPIOC,GPIO_Pin_3,GPIO_Mode_Out_PP);   // Cau hinh chan DQ la OUTPUT
    for (i=8;i>0;i--)
    {
        DS18B20_PORT_DQ_L;  // Keo chan DQ xuong muc '0'
				//delay_us(10);
        //DS18B20_PORT_DQ=(data&0x01); // Viet du lieu vao DS18B20
				if(data&0x01) DS18B20_PORT_DQ_H;
				if(!(data&0x01)) DS18B20_PORT_DQ_L;
        delay_us(60);
        DS18B20_PORT_DQ_H;  // Keo chan DQ len muc '1'
        data>>=1;
    }    
}

/*-----------------------------------------------------------------------------
Noi Dung    :   Khoi tao DS18B20. 
Tham Bien   :   Khong. 
Tra Ve      :   Gia tri tra ve khi khoi tao xong cua DS18B20 (bit).
  -----------------------------------------------------------------------------*/
  	
void DS18B20_Init(void)
{
    GPIO_SetState(GPIOC,GPIO_Pin_3,GPIO_Mode_Out_PP);   // Cau hinh chan DQ la OUTPUT
    DS18B20_PORT_DQ_L;  // Keo DQ xuong muc '0' trong khoang 480us
    delay_us(500);       
    GPIO_SetState(GPIOC,GPIO_Pin_3,GPIO_Mode_IPU);   // Cau hinh chan DQ la INPUT trong khoang 480us
		//while(!(GPIO_PinRead(GPIOB,0)) );//DS18B20 will pull to LOW, if NOT, there is No DS18B20 inline
		//while((GPIO_PinRead(GPIOB,0)) );//After that, it will release line
		//printf("DS18B20 IniT OK\r\n");
    delay_us(500);         
}

/*-----------------------------------------------------------------------------
Noi Dung    :   Ghi 1 byte lenh chuc nang vao DS18B20. 
Tham Bien   :   byte_func: byte lenh chuc nang cua DS18B20. 
Tra Ve      :   Khong.
  -----------------------------------------------------------------------------*/
  
