mohammadfatemieh/BTS/Hardware/IOT_Masterv1/TA_STM32F103RTC8_Masterv2_fwv3/TA_Master_HW2_drivers.c
/*******************************************************************************
* Function Name  : 
* Description    : 
* Input          : None
* Output         : None
* Return         : None
* Attention       : None
*******************************************************************************/
unsigned char SDA_read(void)
{
   unsigned int j;
   GPIO_InitTypeDef GPIO_InitStructure_I;

   /* PB.11 ( DATA in ) */
   GPIO_InitStructure_I.GPIO_Pin = GPIO_Pin_11;
   GPIO_InitStructure_I.GPIO_Speed = GPIO_Speed_50MHz;
   GPIO_InitStructure_I.GPIO_Mode = GPIO_Mode_IPU; 
   GPIO_Init(GPIOB, &GPIO_InitStructure_I);

   GPIO_ResetBits(GPIOB , GPIO_Pin_11);
	
//	GPIO_PinConfigure(GPIOB, 11,
//                      GPIO_IN_PULL_UP, 
//                      GPIO_MODE_INPUT);

   j = GPIO_ReadInputDataBit(GPIOB , GPIO_Pin_11);

   return j;
}

//----------------------------------------------------------------------------------
char s_write_byte(unsigned char value)
//----------------------------------------------------------------------------------
// writes a byte on the Sensibus and checks the acknowledge 
{ 
  unsigned char i,error=0;  
  for (i=0x80;i>0;i/=2)             //shift bit for masking
  { if(i&value){ SDA_H();}          //masking value with i , write to SENSI-BUS
    else{ SDA_L(); }                        
    delay_us(1); //__nop();                        //observe setup time
    SCK_H;                          //clk for SENSI-BUS
    delay_us(5); //__nop();__nop();__nop();        //pulswith approx. 5 us  	
    SCK_L;
    delay_us(1); //__nop();                         //observe hold time
  }
  SDA_H();                          //release DATA-line
  delay_us(1); //__nop();                          //observe setup time
  SCK_H;                            //clk #9 for ack 
  error=SDA_read();                     //check ack (DATA will be pulled down by SHT11)
  SCK_L;        
  return error;                     //error=1 in case of no acknowledge
}

//----------------------------------------------------------------------------------
char s_read_byte(unsigned char ack)
//----------------------------------------------------------------------------------
// reads a byte form the Sensibus and gives an acknowledge in case of "ack=1" 
{ 
  unsigned char i,val=0;
  SDA_H();                           //release DATA-line
  for (i=0x80;i>0;i/=2)             //shift bit for masking
  { SCK_H;                          //clk for SENSI-BUS
    if (SDA_read()) val=(val | i);        //read bit  
    SCK_L;  					 
  }
  if(ack == 1) {SDA_L();}                       //in case of "ack==1" pull down DATA-Line
	else {SDA_H(); }
  delay_us(1);                          //observe setup time
  SCK_H;                            //clk #9 for ack
	delay_us(5); 
  //__nop();__nop();__nop();          //pulswith approx. 5 us 
  SCK_L;
  delay_us(1); 
	//__nop();                          //observe hold time						    
  SDA_H();                           //release DATA-line
  return val;
}
//----------------------------------------------------------------------------------
void s_connectionreset(void)
//----------------------------------------------------------------------------------
// communication reset: DATA-line=1 and at least 9 SCK cycles followed by transstart
//       _____________________________________________________         ________
// DATA:                                                      |_______|
//          _    _    _    _    _    _    _    _    _        ___     ___
// SCK : __| |__| |__| |__| |__| |__| |__| |__| |__| |______|   |___|   |______
{  
  GPIO_InitTypeDef GPIO_InitStructure;
	unsigned char i; 
	
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_10|GPIO_Pin_11;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_PP;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_Init(GPIOB, &GPIO_InitStructure);
	
	SDA_H(); SCK_L;                   //Initial state
  for(i=0;i<9;i++)                  //9 SCK cycles
  {      
		SCK_H;
    SCK_L; 
  }
  s_transstart();                   //transmission start
}
//----------------------------------------------------------------------------------
void s_transstart(void)
//----------------------------------------------------------------------------------
// generates a transmission start 
//       _____         ________
// DATA:      |_______|
//           ___     ___
// SCK : ___|   |___|   |______
{  
   SDA_H(); SCK_L;                   //Initial state
   delay_us(1); //__nop();
   SCK_H;
   delay_us(1); //__nop();
   SDA_L();
   delay_us(1); //__nop();
   SCK_L;  
   delay_us(5); //__nop();__nop();__nop();
   SCK_H;
   delay_us(1); //__nop();
   SDA_H();		   
   delay_us(1); //__nop();
   SCK_L;		   
}
//----------------------------------------------------------------------------------
char s_softreset(void)
//----------------------------------------------------------------------------------
// resets the sensor by a softreset 
{ 
  unsigned char error=0;  
  s_connectionreset();              //reset communication
  error+=s_write_byte(SHT1x_RESET);       //send RESET-command to sensor
  return error;                     //error=1 in case of no response form the sensor
}

//----------------------------------------------------------------------------------
char s_read_statusreg(unsigned char *p_value, unsigned char *p_checksum)
//----------------------------------------------------------------------------------
// reads the status register with checksum (8-bit)
{ 
  unsigned char error=0;
  s_transstart();                   //transmission start
  error=s_write_byte(SHT1x_STATUS_REG_R); //send command to sensor
  *p_value=s_read_byte(ACK);        //read status register (8-bit)
  *p_checksum=s_read_byte(noACK);   //read checksum (8-bit)  
  return error;                     //error=1 in case of no response form the sensor
}

//----------------------------------------------------------------------------------
char s_write_statusreg(unsigned char *p_value)
//----------------------------------------------------------------------------------
// writes the status register with checksum (8-bit)
{ 
  unsigned char error=0;
  s_transstart();                   //transmission start
  error+=s_write_byte(SHT1x_STATUS_REG_W);//send command to sensor
  error+=s_write_byte(*p_value);    //send value of status register
  return error;                     //error>=1 in case of no response form the sensor
}
 							   
//----------------------------------------------------------------------------------
char s_measure(uint16_t *p_value, unsigned char *p_checksum, unsigned char mode)
//----------------------------------------------------------------------------------
// makes a measurement (humidity/temperature) with checksum
{ 
	
	unsigned char error_data;
  unsigned char error=0,SDA_r;
	unsigned char msb,lsb;
  unsigned int i;

  s_transstart();                   //transmission start
  switch(mode){                     //send command to sensor
    case TEMP	: error+=s_write_byte(SHT1x_MEASURE_TEMP); break;
    case HUMI	: error+=s_write_byte(SHT1x_MEASURE_HUMI); break;
    default     : break;	 
  }
  for (i=0;i<65535;i++)   {
		__nop();
    SDA_r = SDA_read();
    if(SDA_r ==0)  {i=0;   break; } // wait until sensor has finished
  }	   //wait until sensor has finished the measurement
  if(SDA_r)    { error_data += 1; }              // or timeout (~2 sec.) is reached
	
	msb=s_read_byte(ACK); //read the first byte (MSB)
  lsb=s_read_byte(ACK); //read the second byte (LSB)
	*p_value=(msb<<8)|(lsb);
  //checksum=s_read_byte(noACK);                //read checksum (8-bit)
	
  //*(p_value)  =s_read_byte(ACK);    //read the first byte (MSB)
  //*(p_value+1)=s_read_byte(ACK);    //read the second byte (LSB)
  *p_checksum =s_read_byte(noACK);  //read checksum
  return error;
}




